class Solution {
public:
    int calLen(int num){
        int bin = 131072; // 2^17
        int len = 18;
        while(bin > num) {(bin >>= 1); len--;}
        return len;
    }
    int concatenatedBinary(int n) {
        int ans = 1, mod = 1e9 + 7;
        for(int i=2; i<=n; i++){
            int len = calLen(i);
            ans = (((long long)ans << len) + i) % mod;
        }
        return ans;
    }
};
/*

if n = 3
1 | 10 | 11
1 << 4
2 << 2
3 << 1
매 숫자 따로 처리하고 그후 총합을 다시 mod

111111111111
1000000001

(num << 1) % mod = (num % mod) << 1
두가지는 개념적으로 동일하다.

1*2^20 + 2*2^18 + 3*2^16 + 4*2^13 + 5*2^3 + 6
(1*2^17 + 2*2^15 + 3*2^13 + 4*2^10 + 5)2^3 + 6
((1*2^7 + 2*2^5 + 3*2^3 + 4)2^10 + 5)2^3 + 6
(((1*2^4 + 2*2^2 + 3)2^3 + 4)2^10 + 5)2^3 + 6
(((1*2^4 + 2*2^2 + 3)2^3 + 4)2^10 + 5)2^3 + 6
((((1*2^2 + 2)2^2 + 3)2^3 + 4)2^10 + 5)2^3 + 6
(((((1)2^2 + 2)2^2 + 3)2^3 + 4)2^10 + 5)2^3 + 6
그냥 묶어서 생각하면 앞에서 부터 계산

결론 무슨 숫자가 나오든 17자리 이내
1e5(17자리 숫자)
*/